/*
 *  Rover -- GRUB 2 filesystem browser for Windows
 *  Copyright (C) 2026  A1ive
 *
 *  This program is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

/*
 * APFS (Apple File System) read-only driver.
 *
 * On-disk structures follow Apple's reference documentation and
 * ref\linux-apfs-rw (apfs_raw.h); the overall approach -- checkpoint
 * selection, object map lookups, sealed-volume fext trees, decmpfs
 * compressed files -- matches ref\7z2602 ApfsHandler.cpp, but the
 * B-trees are walked on demand instead of being slurped into memory.
 *
 * Each volume of the container is exposed as a top-level directory
 * named after the volume.  Encrypted (FileVault) volumes are skipped
 * at mount time; snapshots and fusion containers are not supported.
 *
 * decmpfs compressed files support the zlib, lzvn, lzfse, lzbitmap
 * and uncompressed flavours: zlib decoding reuses grub's gzio, the

#define GRUB_APFS_NX_MAGIC	0x4253584EU	/* "NXSB" */
#define GRUB_APFS_APSB_MAGIC	0x42535041U	/* "APSB" */
#define GRUB_APFS_CMP_MAGIC	0x636D7066U	/* "fpmc" */

#define GRUB_APFS_MAX_FILE_SYSTEMS	100
#define GRUB_APFS_MAX_XP_DESC_BLOCKS	8192
#define GRUB_APFS_TREE_MAX_DEPTH	16
#define GRUB_APFS_MAX_META_SIZE		0x1000000	/* xattr/decmpfs blobs */
#define GRUB_APFS_MAX_CDATA_SIZE	0x20000	/* one compressed 64 KiB block */
#define GRUB_APFS_CMP_BLOCK		0x10000

/* object types (obj_phys::type & 0xffff) */
#define GRUB_APFS_OBJECT_TYPE_NX_SUPERBLOCK	0x01
#define GRUB_APFS_OBJECT_TYPE_BTREE		0x02
#define GRUB_APFS_OBJECT_TYPE_BTREE_NODE	0x03
#define GRUB_APFS_OBJECT_TYPE_OMAP		0x0B
#define GRUB_APFS_OBJECT_TYPE_FS		0x0D
#define GRUB_APFS_OBJECT_TYPE_FSTREE		0x0E
#define GRUB_APFS_OBJECT_TYPE_FEXT_TREE		0x1F
#define GRUB_APFS_OBJECT_TYPE_MASK		0xFFFF
#define GRUB_APFS_OBJ_PHYSICAL			0x40000000U

/* B-tree node flags */
#define GRUB_APFS_BTNODE_ROOT		0x0001
#define GRUB_APFS_BTNODE_LEAF		0x0002
#define GRUB_APFS_BTNODE_FIXED_KV_SIZE	0x0004
#define GRUB_APFS_BTNODE_HASHED		0x0008
#define GRUB_APFS_BTNODE_NOHEADER	0x0010

#define GRUB_APFS_BTOFF_INVALID	0xFFFF

/* object map value flags */
#define GRUB_APFS_OMAP_VAL_DELETED	0x01
#define GRUB_APFS_OMAP_VAL_NOHEADER	0x08

/* file-system record types (key >> 60) */
#define GRUB_APFS_TYPE_INODE		3
#define GRUB_APFS_TYPE_XATTR		4
#define GRUB_APFS_TYPE_FILE_EXTENT	8
#define GRUB_APFS_TYPE_DIR_REC		9

#define GRUB_APFS_OBJ_ID_MASK		0x0FFFFFFFFFFFFFFFULL
#define GRUB_APFS_OBJ_TYPE_SHIFT	60

#define GRUB_APFS_ROOT_DIR_INO	2

#define GRUB_APFS_DREC_LEN_MASK	0x3FF

/* directory record file types (drec value flags & 0xF, DT_* values) */
#define GRUB_APFS_DT_DIR	4
#define GRUB_APFS_DT_REG	8
#define GRUB_APFS_DT_LNK	10

/* volume incompatible features */
#define GRUB_APFS_INCOMPAT_CASE_INSENSITIVE	0x01
#define GRUB_APFS_INCOMPAT_NORM_INSENSITIVE	0x08

/* volume flags */
#define GRUB_APFS_FS_UNENCRYPTED	0x01

/* inode bsd_flags */
#define GRUB_APFS_INOBSD_COMPRESSED	0x20

/* inode mode */
#define GRUB_APFS_MODE_IFMT	0xF000
#define GRUB_APFS_MODE_IFDIR	0x4000
#define GRUB_APFS_MODE_IFLNK	0xA000

/* xattr value flags */
#define GRUB_APFS_XATTR_DATA_STREAM	0x01
#define GRUB_APFS_XATTR_DATA_EMBEDDED	0x02

/* inode extended field types */
#define GRUB_APFS_INO_EXT_TYPE_DSTREAM	8

#define GRUB_APFS_FILE_EXTENT_LEN_MASK	0x00FFFFFFFFFFFFFFULL

/* decmpfs algorithms */
#define GRUB_APFS_COMPRESS_ZLIB_ATTR	3
#define GRUB_APFS_COMPRESS_ZLIB_RSRC	4
#define GRUB_APFS_COMPRESS_LZVN_ATTR	7
#define GRUB_APFS_COMPRESS_LZVN_RSRC	8
#define GRUB_APFS_COMPRESS_PLAIN_ATTR	9
#define GRUB_APFS_COMPRESS_PLAIN_RSRC	10
#define GRUB_APFS_COMPRESS_LZFSE_ATTR	11
#define GRUB_APFS_COMPRESS_LZFSE_RSRC	12
#define GRUB_APFS_COMPRESS_LZBITMAP_ATTR	13
#define GRUB_APFS_COMPRESS_LZBITMAP_RSRC	14

#define GRUB_APFS_XATTR_SYMLINK	"com.apple.fs.symlink"
#define GRUB_APFS_XATTR_DECMPFS	"com.apple.decmpfs"
#define GRUB_APFS_XATTR_RSRC	"com.apple.ResourceFork"

PRAGMA_BEGIN_PACKED
struct grub_apfs_obj_phys
{
	grub_uint64_t cksum;
	grub_uint64_t oid;
	grub_uint64_t xid;
	grub_uint32_t type;
	grub_uint32_t subtype;
} GRUB_PACKED;

struct grub_apfs_nx_super
{
	struct grub_apfs_obj_phys o;		/* 0x00 */
	grub_uint32_t magic;			/* 0x20 */
	grub_uint32_t block_size;
	grub_uint64_t block_count;		/* 0x28 */
	grub_uint64_t features;			/* 0x30 */
	grub_uint64_t ro_compat_features;
	grub_uint64_t incompat_features;	/* 0x40 */
	grub_uint8_t uuid[16];			/* 0x48 */
	grub_uint64_t next_oid;			/* 0x58 */
	grub_uint64_t next_xid;
	grub_uint32_t xp_desc_blocks;		/* 0x68 */
	grub_uint32_t xp_data_blocks;
	grub_uint64_t xp_desc_base;		/* 0x70 */
	grub_uint64_t xp_data_base;
	grub_uint32_t xp_desc_next;		/* 0x80 */
	grub_uint32_t xp_data_next;
	grub_uint32_t xp_desc_index;		/* 0x88 */
	grub_uint32_t xp_desc_len;
	grub_uint32_t xp_data_index;		/* 0x90 */
	grub_uint32_t xp_data_len;
	grub_uint64_t spaceman_oid;		/* 0x98 */
	grub_uint64_t omap_oid;			/* 0xA0 */
	grub_uint64_t reaper_oid;
	grub_uint32_t test_type;		/* 0xB0 */
	grub_uint32_t max_file_systems;
	grub_uint64_t fs_oid[GRUB_APFS_MAX_FILE_SYSTEMS];	/* 0xB8 */
} GRUB_PACKED;

struct grub_apfs_omap_phys
{
	struct grub_apfs_obj_phys o;		/* 0x00 */
	grub_uint32_t flags;			/* 0x20 */
	grub_uint32_t snap_count;
	grub_uint32_t tree_type;
	grub_uint32_t snapshot_tree_type;
	grub_uint64_t tree_oid;			/* 0x30 */
} GRUB_PACKED;

struct grub_apfs_nloc
{
	grub_uint16_t off;
	grub_uint16_t len;
} GRUB_PACKED;

struct grub_apfs_kvloc
{
	struct grub_apfs_nloc k;
	struct grub_apfs_nloc v;
} GRUB_PACKED;

struct grub_apfs_kvoff
{
	grub_uint16_t k;
	grub_uint16_t v;
} GRUB_PACKED;

struct grub_apfs_btnode
{
	struct grub_apfs_obj_phys o;		/* 0x00 */
	grub_uint16_t flags;			/* 0x20 */
	grub_uint16_t level;
	grub_uint32_t nkeys;
	struct grub_apfs_nloc table_space;	/* 0x28 */
	struct grub_apfs_nloc free_space;
	struct grub_apfs_nloc key_free_list;
	struct grub_apfs_nloc val_free_list;	/* header ends at 0x38 */
} GRUB_PACKED;

struct grub_apfs_btinfo
{
	grub_uint32_t flags;
	grub_uint32_t node_size;
	grub_uint32_t key_size;
	grub_uint32_t val_size;
	grub_uint32_t longest_key;
	grub_uint32_t longest_val;
	grub_uint64_t key_count;
	grub_uint64_t node_count;
} GRUB_PACKED;			/* 0x28 bytes at the end of a root node */

struct grub_apfs_omap_val
{
	grub_uint32_t flags;
	grub_uint32_t size;
	grub_uint64_t paddr;
} GRUB_PACKED;

struct grub_apfs_modified_by
{
	grub_uint8_t id[32];
	grub_uint64_t timestamp;
	grub_uint64_t last_xid;
} GRUB_PACKED;

struct grub_apfs_vol_super
{
	struct grub_apfs_obj_phys o;		/* 0x00 */
	grub_uint32_t magic;			/* 0x20 */
	grub_uint32_t fs_index;
	grub_uint64_t features;			/* 0x28 */
	grub_uint64_t ro_compat_features;
	grub_uint64_t incompat_features;	/* 0x38 */
	grub_uint64_t unmount_time;		/* 0x40 */
	grub_uint64_t fs_reserve_block_count;
	grub_uint64_t fs_quota_block_count;
	grub_uint64_t fs_alloc_count;		/* 0x58 */
	grub_uint8_t meta_crypto[20];		/* 0x60 */
	grub_uint32_t root_tree_type;		/* 0x74 */
	grub_uint32_t extentref_tree_type;
	grub_uint32_t snap_meta_tree_type;
	grub_uint64_t omap_oid;			/* 0x80 */
	grub_uint64_t root_tree_oid;		/* 0x88 */
	grub_uint64_t extentref_tree_oid;
	grub_uint64_t snap_meta_tree_oid;
	grub_uint64_t revert_to_xid;		/* 0xA0 */
	grub_uint64_t revert_to_sblock_oid;
	grub_uint64_t next_obj_id;		/* 0xB0 */
	grub_uint64_t num_files;		/* 0xB8 */
	grub_uint64_t num_directories;
	grub_uint64_t num_symlinks;
	grub_uint64_t num_other_fsobjects;
	grub_uint64_t num_snapshots;
	grub_uint64_t total_blocks_alloced;	/* 0xE0 */
	grub_uint64_t total_blocks_freed;
	grub_uint8_t vol_uuid[16];		/* 0xF0 */
	grub_uint64_t last_mod_time;		/* 0x100 */
	grub_uint64_t fs_flags;			/* 0x108 */
	struct grub_apfs_modified_by formatted_by;	/* 0x110 */
	struct grub_apfs_modified_by modified_by[8];	/* 0x140 */
	grub_uint8_t volname[256];		/* 0x2C0 */
	grub_uint32_t next_doc_id;		/* 0x3C0 */
	grub_uint16_t role;
	grub_uint16_t reserved;
	grub_uint64_t root_to_xid;		/* 0x3C8 */
	grub_uint64_t er_state_oid;
	grub_uint64_t cloneinfo_id_epoch;	/* 0x3D8 */
	grub_uint64_t cloneinfo_xid;
	grub_uint64_t snap_meta_ext_oid;	/* 0x3E8 */
	grub_uint8_t volume_group_id[16];	/* 0x3F0 */
	grub_uint64_t integrity_meta_oid;	/* 0x400 */
	grub_uint64_t fext_tree_oid;		/* 0x408 */
	grub_uint32_t fext_tree_type;		/* 0x410 */
} GRUB_PACKED;

struct grub_apfs_dstream
{
	grub_uint64_t size;
	grub_uint64_t alloced_size;
	grub_uint64_t default_crypto_id;
	grub_uint64_t total_bytes_written;
	grub_uint64_t total_bytes_read;
} GRUB_PACKED;

struct grub_apfs_inode_val
{
	grub_uint64_t parent_id;		/* 0x00 */
	grub_uint64_t private_id;
	grub_uint64_t create_time;		/* 0x10 */
	grub_uint64_t mod_time;
	grub_uint64_t change_time;		/* 0x20 */
	grub_uint64_t access_time;
	grub_uint64_t internal_flags;		/* 0x30 */
	grub_uint32_t nchildren_or_nlink;	/* 0x38 */
	grub_uint32_t default_protection_class;
	grub_uint32_t write_generation_counter;	/* 0x40 */
	grub_uint32_t bsd_flags;
	grub_uint32_t owner;			/* 0x48 */
	grub_uint32_t group;
	grub_uint16_t mode;			/* 0x50 */
	grub_uint16_t pad1;
	grub_uint64_t uncompressed_size;	/* 0x54 */
} GRUB_PACKED;			/* 0x5C bytes, then extended fields */

struct grub_apfs_xf_blob
{
	grub_uint16_t num_exts;
	grub_uint16_t used_data;
} GRUB_PACKED;

struct grub_apfs_x_field
{
	grub_uint8_t type;
	grub_uint8_t flags;
	grub_uint16_t size;
} GRUB_PACKED;

struct grub_apfs_drec_val
{
	grub_uint64_t file_id;
	grub_uint64_t date_added;
	grub_uint16_t flags;
} GRUB_PACKED;			/* 0x12 bytes, then extended fields */

struct grub_apfs_xattr_val
{
	grub_uint16_t flags;
	grub_uint16_t xdata_len;
} GRUB_PACKED;			/* followed by xdata */

struct grub_apfs_xattr_dstream
{
	grub_uint64_t xattr_obj_id;
	struct grub_apfs_dstream dstream;
} GRUB_PACKED;

struct grub_apfs_file_extent_val
{
	grub_uint64_t len_and_flags;
	grub_uint64_t phys_block_num;
	grub_uint64_t crypto_id;
} GRUB_PACKED;

struct grub_apfs_cmp_hdr
{
	grub_uint32_t signature;
	grub_uint32_t algo;
	grub_uint64_t size;
} GRUB_PACKED;

